# running in substructor_formal_bmc/src/
read -formal -sv substructor_formal.v
prep -top substructor_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
